In [1]:
from sqlalchemy import create_engine
import pandas as pd

from params import (username, password,db_name)

In [2]:
db_string = f'postgresql://{username}:{password}@localhost:5432/{db_name}'
engine = create_engine(db_string)
connection = engine.connect()

In [3]:
employee_df = pd.read_sql_query('select * from employees',con=connection)
salary_df = pd.read_sql_query('select * from salaries',con=connection)
titles_df = pd.read_sql_query('select * from titles',con=connection)

In [9]:
employee_salary_title_df = pd.read_sql_query('SELECT t.title AS "Title",round(avg(s.salary),2) AS "Average_salary" \
                                             FROM employees e, salaries s, titles t WHERE e.emp_no = s.emp_no \
                                             AND e.emp_title_id = t.title_id \
                                             GROUP BY t.title', con=connection)
employee_salary_title_df.head()

                Title  Average_salary
0  Assistant Engineer        48564.43
1            Engineer        48535.34
2             Manager        51531.04
3     Senior Engineer        48506.80
4        Senior Staff        58550.17